import { TestConfig } from '@/components/TestsQuestionnarie/typesTestPage'

const k10Questions = [
  'Протягом останніх 30 днів, як часто ви відчували себе втомленим/втомленою?',
  'Протягом останніх 30 днів, як часто ви були нервовими?',
  'Протягом останніх 30 днів, як часто ви були настільки нервовими, що не могли заспокоїтися?',
  'Протягом останніх 30 днів, як часто ви відчували себе неспокійно?',
  'Протягом останніх 30 днів, як часто ви відчували себе настільки неспокійно, що не могли всидіти на місці?',
  'Протягом останніх 30 днів, як часто ви відчували себе пригніченими?',
  'Протягом останніх 30 днів, як часто ви вважали, що ніщо не може вас порадувати?',
  'Протягом останніх 30 днів, як часто ви відчували, що все дається дуже важко?',
  'Протягом останніх 30 днів, як часто ви відчували себе безнадійно?',
  'Протягом останніх 30 днів, як часто ви відчували, що нічого не варте?',
]

const k10Test: TestConfig<'radio'> = {
  id: 'k10',
  title: 'Шкала психологічного дистресу K10',
  type: 'radio',
  questions: k10Questions.map((text, i) => ({
    id: `K10test${i + 1}`,
    text,
    options: [
      { text: 'Ніколи', value: 1 },
      { text: 'Рідко', value: 2 },
      { text: 'Іноді', value: 3 },
      { text: 'Часто', value: 4 },
      { text: 'Завжди', value: 5 },
    ],
  })),
  scoring: { perOptionValue: true },
  resultMapping: [
    {
      min: 0,
      max: 20,
      label:
        'Цей показник говорить, що ви знаходитеся в “зеленій зоні”, психологічний стан є нормальним. Якщо бали близькі до 20, варто бути уважними та додати турботи про себе.',
    },
    {
      min: 21,
      max: 29,
      label:
        'Ви знаходитеся в жовтій зоні. Це говорить про те, що ви маєте легке психоемоційне виснаження. Вам варто розпочати відновлення вашого стану. Чим раніше ви розпочнете це робити, тим легшим буде процес та якіснішим результат.',
    },
    {
      min: 30,
      max: 34,
      label:
        'Жовтогаряча зона психоемоційне виснаження. На цьому етапі важливо звернутися до спеціаліста у сфері охорони психічного здоров’я для проведення додаткового обстеження. Такі бали можуть вказувати на те, що розпочався процес розвитку психічних розладів (депресивні стани, тривожні розлади, ПТСР тощо).',
    },
    {
      min: 35,
      max: Infinity,
      label:
        'Червона зона. Сильне психоемоційне виснаження. За таких балів обов’язково варто звернутися до спеціаліста, щоб уточнити причини психоемоційного виснаження та його впливу на ваше здоров’я. Це може бути лікар (психіатр, невролог), психотерапевт чи психолог.',
    },
  ],
}

export default k10Test
